10/data/attachments/7219f0febba63733.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fbe1899d-da72-471c-9ef4-4418cf35f086</nif:username>
            <nif:friendToBeAdded>Jeffrey_kid_Friend_42506_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>